import asyncio

import random

from AbdoX import app

from pyrogram.types import (InlineKeyboardButton,

                            InlineKeyboardMarkup, Message)


from pyrogram import filters, Client





txt = [


" حالتك النفسيه🙂💔 ",
"مبدأك في الحياه🤔  ", 
" مفيش اسئله خلصنا😂  ", 
" عندك كام سنه  ", 
"سهل انك تحس بالذنب ؟",
"عملت حاجة انت مش حاببها لمجرد ان الشخص الي بتحبه عايز كدا؟",
"عملت حاجة انت مش حاببها لمجرد ان الشخص الي بتحبه عايز كدا؟",
"لو حد خسر ثقتك بتديهالو تاني؟",
"ما هي مواصفات شريك حياتك؟",
"مين هو الشخص الي لما بتحب تنعزل بتثتثنيه عن كل الي حواليك ويفضل معاك؟",
"أكثر جملة أثرت بك في حياتك؟",
"اذا اردت ان تبكي الان , فعلى من تبكي؟من ستختار ليمسح دموعك ؟",
"تحس انك مستعد للقاء الله ولا باقي.؟",
"كنت بتحب تقعد قدام دايما في المدرسة؟",
"تحب حياة الاغنياء؟",
"ككسرت حد",
"تتحوزني🥰",
"انت شخص سلبي؟",
"روح ذاكــــر يا فاشــل كت اي اللي بتلعبها☹️🍯",
"هات بــوســه وفكك من السوال❤️",
"عندك كام اكس",
"هل يمكنك أن تتولى أمر الأعمال المنزلية أم أنك سوف تفشل في ذلك؟",
"  ما هي الصفة التي تود تغييرها في الشخص الآخر؟ وهل حاولت ذلك من قبل؟ وما النتيجة التي حصلت عليها؟",
"هل من الممكن أن تضر شخصاً لمجرد أنك تكرهه؟",
"بتحب/ي حد في البار وخايف تعترفله",
"معجب بمين في البار",
"ممكــــن ابــــوســك",
"بتعرف تعمل صداقات بسهولة؟",
"بتحب الهدوم الكاجوال اكتر ولا الرسمية؟",
        ]


        


@app.on_message(filters.command(["تويت","كت","صراحه","اسال","اسئله"], ""))

async def ahrof(client: Client, message: Message):

      a = random.choice(txt)

      await message.reply(

        f"{a}")
